app/controllers/school_classes_controller.rb

    def create
        @schoolclass = SchoolClass.create(school_class_params)
---
INSERT INTO "school_classes" DEFAULT VALUES

    def show
        @schoolclass = SchoolClass.find(params[:id])
---
SELECT  "school_classes".* FROM "school_classes" WHERE "school_classes"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]