app/controllers/students_controller.rb

INSERT INTO "students" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", "2020-12-10 22:24:35.482843"], ["updated_at", "2020-12-10 22:24:35.482843"]]
---
    def create
        @student = Student.create(student_params)